Revit 2027 API
Units.GetFormatOptions Method
 Gets the default FormatOptions for a spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetFormatOptions(
	ForgeTypeId specTypeId
)
Public Function GetFormatOptions (
	specTypeId As ForgeTypeId
) As FormatOptions
public:
FormatOptions^ GetFormatOptions(
	ForgeTypeId^ specTypeId
)
member GetFormatOptions :
        specTypeId : ForgeTypeId -> FormatOptions
Parameters
specTypeId ForgeTypeId
 Identifier of the spec.
Return Value
FormatOptions
 A copy of the FormatOptions.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace